In [3]:
# =============================================================================
# script that creates a dataframe with all necessary data about countries
# =============================================================================



# adding directory to pythonpath for allow own functions
# allows to import own functions
import sys, os
path_name = os.getcwd()
root_project = os.path.split(path_name)[0]
sys.path.append(root_project)

from src.utils.help_func import extract_indicator, last_values
import json
import networkx as nx
import numpy as np
import pandas as pd


df_indicators = pd.read_csv('../data/raw/world_indicators_data.csv')
df_pop_plus = pd.read_csv('../data/raw/country_population.csv', skiprows=4)
df_location = pd.read_csv('../data/raw/tableconvert_iso.csv')
df_continents = pd.read_csv('../data/raw/country_to_continent.csv')
G = nx.read_gpickle('../data/interim/routes_countries.gpickle')
with open('../data/interim/alpha2_to_alpha3.txt', 'r') as file:
    alpha2_to_alpha3 = json.load(file)

# extracting data about population
df_male = last_values(extract_indicator(df_indicators, 'Population, male'))
df_male.rename(
    columns={
        'Country Name': 'country_name',
        'Country Code': 'country_code',
        'last_value': 'male_pop'},
    inplace=True)
df_female = last_values(extract_indicator(df_indicators, 'Population, female'))
df_female.rename(columns={'last_value': 'female_pop'}, inplace=True)

df_population = pd.concat([df_male, df_female.loc[:, 'female_pop']], axis=1)
df_population['total_pop'] = df_population['male_pop'] + \
    df_population['female_pop']
df_population = df_population[['country_name', 'country_code', 'total_pop']]

In [4]:
df_population

                       country_name country_code     total_pop
0                        Arab World          ARB  4.197906e+08
1            Caribbean small states          CSS  7.234899e+06
2    Central Europe and the Baltics          CEB  1.025119e+08
3        Early-demographic dividend          EAR  3.249141e+09
4               East Asia & Pacific          EAS  2.328008e+09
..                              ...          ...           ...
259           Virgin Islands (U.S.)          VIR  1.069770e+05
260              West Bank and Gaza          PSE  4.569087e+06
261                     Yemen, Rep.          YEM  2.849869e+07
262                          Zambia          ZMB  1.735182e+07
263                        Zimbabwe          ZWE  1.443902e+07

[264 rows x 3 columns]

In [9]:
df_population.loc[df_population['country_code']=='DMA']

    country_name country_code  total_pop
102     Dominica          DMA        NaN

In [5]:
df_pop_plus

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,Unnamed: 64
0,Aruba,ABW,"Population, total",SP.POP.TOTL,54211.0,55438.0,56225.0,56695.0,57032.0,57360.0,...,102046.0,102560.0,103159.0,103774.0,104341.0,104872.0,105366.0,105845.0,106314.0,NaN
1,Afghanistan,AFG,"Population, total",SP.POP.TOTL,8996973.0,9169410.0,9351441.0,9543205.0,9744781.0,9956320.0,...,30117413.0,31161376.0,32269589.0,33370794.0,34413603.0,35383128.0,36296400.0,37172386.0,38041754.0,NaN
2,Angola,AGO,"Population, total",SP.POP.TOTL,5454933.0,5531472.0,5608539.0,5679458.0,5735044.0,5770570.0,...,24220661.0,25107931.0,26015780.0,26941779.0,27884381.0,28842484.0,29816748.0,30809762.0,31825295.0,NaN
3,Albania,ALB,"Population, total",SP.POP.TOTL,1608800.0,1659800.0,1711319.0,1762621.0,1814135.0,1864791.0,...,2905195.0,2900401.0,2895092.0,2889104.0,2880703.0,2876101.0,2873457.0,2866376.0,2854191.0,NaN
4,Andorra,AND,"Population, total",SP.POP.TOTL,13411.0,14375.0,15370.0,16412.0,17469.0,18549.0,...,83747.0,82427.0,80774.0,79213.0,78011.0,77297.0,77001.0,77006.0,77142.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
259,Kosovo,XKX,"Population, total",SP.POP.TOTL,947000.0,966000.0,994000.0,1022000.0,1050000.0,1078000.0,...,1791000.0,1807106.0,1818117.0,1812771.0,1788196.0,1777557.0,1791003.0,1797085.0,1794248.0,NaN
260,"Yemen, Rep.",YEM,"Population, total",SP.POP.TOTL,5315355.0,5393036.0,5473671.0,5556766.0,5641597.0,5727751.0,...,23807588.0,24473178.0,25147109.0,25823485.0,26497889.0,27168210.0,27834821.0,28498687.0,29161922.0,NaN
261,South Africa,ZAF,"Population, total",SP.POP.TOTL,17099840.0,17524533.0,17965725.0,18423161.0,18896307.0,19384841.0,...,52004172.0,52834005.0,53689236.0,54545991.0,55386367.0,56203654.0,57000451.0,57779622.0,58558270.0,NaN
262,Zambia,ZMB,"Population, total",SP.POP.TOTL,3070776.0,3164329.0,3260650.0,3360104.0,3463213.0,3570464.0,...,14023193.0,14465121.0,14926504.0,15399753.0,15879361.0,16363507.0,16853688.0,17351822.0,17861030.0,NaN
263,Zimbabwe,ZWE,"Population, total",SP.POP.TOTL,3776681.0,3905034.0,4039201.0,4178726.0,4322861.0,4471177.0,...,12894316.0,13115131.0,13350356.0,13586681.0,13814629.0,14030390.0,14236745.0,14439018.0,14645468.0,NaN

In [6]:
df_pop_plus.loc[df_pop_plus['Country Code']=='DMA']

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,Unnamed: 64
55,Dominica,DMA,"Population, total",SP.POP.TOTL,60011.0,61032.0,61982.0,62918.0,63926.0,65038.0,...,70916.0,70965.0,71016.0,71085.0,71183.0,71307.0,71458.0,71625.0,71808.0,NaN

In [19]:
map_pop = df_pop_plus[['Country Code', '2019']].set_index('Country Code', drop=True).iloc[:,0].to_dict()

In [23]:
map_pop['DMA']

71808.0

In [28]:
df_population.loc[df_population['total_pop'].isna()]

                  country_name country_code  total_pop
33              Not classified          INX        NaN
50              American Samoa          ASM        NaN
51                     Andorra          AND        NaN
68                     Bermuda          BMU        NaN
74      British Virgin Islands          VGB        NaN
83              Cayman Islands          CYM        NaN
102                   Dominica          DMA        NaN
112              Faroe Islands          FRO        NaN
122                  Gibraltar          GIB        NaN
124                  Greenland          GRL        NaN
141                Isle of Man          IMN        NaN
152                     Kosovo          XKX        NaN
161              Liechtenstein          LIE        NaN
171           Marshall Islands          MHL        NaN
177                     Monaco          MCO        NaN
184                      Nauru          NRU        NaN
193   Northern Mariana Islands          MNP        NaN
197                      Palau          PLW        NaN
211                 San Marino          SMR        NaN
219  Sint Maarten (Dutch part)          SXM        NaN
228        St. Kitts and Nevis          KNA        NaN
230   St. Martin (French part)          MAF        NaN
247   Turks and Caicos Islands          TCA        NaN
248                     Tuvalu          TUV        NaN

In [29]:
# add second source to fill nans
df_population['total_pop'] = df_population['total_pop'].fillna(df_population['country_code'].map(map_pop))

In [30]:
df_population.loc[df_population['country_code']=='DMA']

    country_name country_code  total_pop
102     Dominica          DMA    71808.0

In [31]:
df_population.loc[df_population['total_pop'].isna()]

      country_name country_code  total_pop
33  Not classified          INX        NaN

In [48]:
df_countries = pd.read_pickle(
    '../data/interim/country_info_final.pickle')

In [49]:
df_countries.loc[df_countries['country_code']=='DMA']

,country_name,country_code,total_pop,arrivals,departures,latitude,longitude,arrivals/total,departures/total,arrivals/population,departures/population,continent_name,continent_code,departures/day
52,Dominica,DMA,71808.0,63000.0,279898.405904,15.4167,-61.3333,0.000043,0.000196,0.87734,3.897872,North America,NaN,"{'PRI': 504, 'ATG': 44, 'BRB': 112, 'VCT': 13,..."

In [42]:
df_countries = pd.read_pickle('../data/interim/country_info.pickle')

In [43]:
df_countries.loc[df_countries['country_code']=='DMA']

,country_name,country_code,total_pop,arrivals,departures,latitude,longitude,arrivals/total,departures/total,arrivals/population,departures/population,continent_name,continent_code,destinations
52,Dominica,DMA,71808.0,63000.0,NaN,15.4167,-61.3333,0.000044,NaN,0.87734,NaN,North America,NaN,"[PRI, ATG, BRB, VCT, VGB, VIR]"

In [44]:
df = pd.read_pickle('../data/interim/country_info_nonans.pickle')

In [45]:
df.loc[df_countries['country_code']=='DMA']

,country_name,country_code,total_pop,arrivals,departures,latitude,longitude,arrivals/total,departures/total,arrivals/population,departures/population,continent_name,continent_code,destinations
52,Dominica,DMA,71808.0,63000.0,279898.405904,15.4167,-61.3333,0.000043,0.000196,0.87734,3.897872,North America,NaN,"[PRI, ATG, BRB, VCT, VGB, VIR]"